WilhelmMeyer/F28379D_LPEE/control_logic_adc.h
/*
 * control_logic_adc.h
 *
 *  Created on: 13 de out de 2023
 *      Author: willj
 */
#include "F2837xD_device.h"


#ifndef CONTROL_LOGIC_ADC_H_
#define CONTROL_LOGIC_ADC_H_

#define ADCTRIG_EPWM1_SOCA 0x5
#define ADCTRIG_EPWM1_SOCB 0x6
#define ADCTRIG_EPWM2_SOCA 0x7
#define ADCTRIG_EPWM2_SOCB 0x8
#define ADCTRIG_EPWM3_SOCA 0x9
#define ADCTRIG_EPWM3_SOCB 0xA
#define ADCTRIG_EPWM4_SOCA 0xB
#define ADCTRIG_EPWM4_SOCB 0xC
#define ADCTRIG_EPWM5_SOCA 0xD
#define ADCTRIG_EPWM5_SOCB 0xE
#define ADCTRIG_EPWM6_SOCA 0xF
#define ADCTRIG_EPWM6_SOCB 0x10
#define ADCTRIG_EPWM7_SOCA 0x11
#define ADCTRIG_EPWM7_SOCB 0x12
#define ADCTRIG_EPWM8_SOCA 0x13
#define ADCTRIG_EPWM8_SOCB 0x14
#define ADCTRIG_EPWM9_SOCA 0x15
#define ADCTRIG_EPWM9_SOCB 0x16
#define ADCTRIG_EPWM10_SOCA 0x17
#define ADCTRIG_EPWM10_SOCB 0x18
#define ADCTRIG_EPWM11_SOCA 0x19
#define ADCTRIG_EPWM11_SOCB 0x1A
#define ADCTRIG_EPWM12_SOCA 0x1B
#define ADCTRIG_EPWM12_SOCB 0x1C


//
// ADC Module
//
#define ADCA_MODULE 0
#define ADCB_MODULE 1
#define ADCC_MODULE 2
#define ADCD_MODULE 3


//
// ADC Channel
//
#define ADCA0_CHANNEL 0x0
#define ADCA1_CHANNEL 0x1
#define ADCA2_CHANNEL 0x2
#define ADCA3_CHANNEL 0x3
#define ADCA4_CHANNEL 0x4
#define ADCA5_CHANNEL 0x5
#define ADCA6_CHANNEL 0x6
#define ADCA7_CHANNEL 0x7
#define ADCA8_CHANNEL 0x8
#define ADCA9_CHANNEL 0x9
#define ADCA10_CHANNEL 0xA
#define ADCA11_CHANNEL 0xB
#define ADCA12_CHANNEL 0xC
#define ADCA13_CHANNEL 0xD
#define ADCA14_CHANNEL 0xE
#define ADCA15_CHANNEL 0xF
#define ADCB0_CHANNEL 0x10
#define ADCB1_CHANNEL 0x11
#define ADCB2_CHANNEL 0x12
#define ADCB3_CHANNEL 0x13
#define ADCB4_CHANNEL 0x14
#define ADCB5_CHANNEL 0x15
#define ADCB6_CHANNEL 0x16
#define ADCB7_CHANNEL 0x17
#define ADCB8_CHANNEL 0x18
#define ADCB9_CHANNEL 0x19
#define ADCB10_CHANNEL 0x1A
#define ADCB11_CHANNEL 0x1B
#define ADCB12_CHANNEL 0x1C
#define ADCB13_CHANNEL 0x1D
#define ADCB14_CHANNEL 0x1E
#define ADCB15_CHANNEL 0x1F
#define ADCC0_CHANNEL 0x20
#define ADCC1_CHANNEL 0x21
#define ADCC2_CHANNEL 0x22
#define ADCC3_CHANNEL 0x23
#define ADCC4_CHANNEL 0x24
#define ADCC5_CHANNEL 0x25
#define ADCC6_CHANNEL 0x26
#define ADCC7_CHANNEL 0x27
#define ADCC8_CHANNEL 0x28
#define ADCC9_CHANNEL 0x29
#define ADCC10_CHANNEL 0x2A
#define ADCC11_CHANNEL 0x2B
#define ADCC12_CHANNEL 0x2C
#define ADCC13_CHANNEL 0x2D
#define ADCC14_CHANNEL 0x2E
#define ADCC15_CHANNEL 0x2F
#define ADCD0_CHANNEL 0x30
#define ADCD1_CHANNEL 0x31
#define ADCD2_CHANNEL 0x32
#define ADCD3_CHANNEL 0x33
#define ADCD4_CHANNEL 0x34
#define ADCD5_CHANNEL 0x35
#define ADCD6_CHANNEL 0x36
#define ADCD7_CHANNEL 0x37
#define ADCD8_CHANNEL 0x38
#define ADCD9_CHANNEL 0x39
#define ADCD10_CHANNEL 0x3A
#define ADCD11_CHANNEL 0x3B
#define ADCD12_CHANNEL 0x3C
#define ADCD13_CHANNEL 0x3D
#define ADCD14_CHANNEL 0x3E
#define ADCD15_CHANNEL 0x3F



#endif /* CONTROL_LOGIC_ADC_H_ */
